DELETE FROM user_roles;
DELETE FROM users;
DELETE FROM meals;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO user_roles (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO meals (userid, description, calories, datetime)
VALUES (100000, 'Завтрак', 500, '2020-12-30 10:00:00'),
       (100000, 'Обед', 1000, '2020-12-30 13:00:00'),
       (100000, 'Ужин', 500, '2020-12-30 20:00:00'),
       (100000, 'Еда на граничное значение', 100, '2020-12-31 00:00:00'),
       (100000, 'Завтрак', 1000, '2020-12-31 10:00:00'),
       (100000, 'Обед', 500, '2020-12-31 13:00:00'),
       (100000, 'Ужин', 410, '2020-12-31 20:00:00'),
    (100001, 'Завтрак', 500, '2020-12-30 10:00:00'),
    (100001, 'Обед', 1000, '2020-12-30 13:00:00'),
    (100001, 'Ужин', 500, '2020-12-30 20:00:00'),
    (100001, 'Еда на граничное значение', 100, '2020-12-31 00:00:00'),
    (100001, 'Завтрак', 1000, '2020-12-31 10:00:00'),
    (100001, 'Обед', 500, '2020-12-31 13:00:00'),
    (100001, 'Ужин', 410, '2020-12-31 20:00:00');